Repository: nieich/flutter_pass_app
Catalog: lib/l10n/app_*.arb
Languages: es, fr, zh

# title
source: Passes
es: Pases
fr: Pass
zh: 通行证

source: OK
es: Aceptar
zh: 好的

source: Cancel
es: Cancelar
fr: Annuler
zh: 取消

source: Delete
es: Eliminar
fr: Supprimer
zh: 删除

source: Share
es: Compartir
fr: Partager
zh: 分享

source: Add Pass from File
es: Añadir Pase Desde Archivo
fr: Ajouter un Pass Depuis un Fichier
zh: 从文件添加通行证

# pickedFile
source: Picked file: {fileName}
es: Archivo seleccionado: {fileName}
fr: Fichier sélectionné : {fileName}
zh: 已选择文件：{fileName}

# invalidFileType
source: Invalid file type. Please select a .pkpass file.
es: Tipo de archivo no válido. Por favor, seleccione un archivo .pkpass.
fr: Type de fichier invalide. Veuillez sélectionner un fichier .pkpass.
zh: 无效的文件类型。请选择一个 .pkpass 文件。

source: Sharing Pass
es: Compartiendo Pase
fr: Partage du Pass
zh: 分享通行证

source: No Passes
es: No Hay Pases
fr: Aucun Pass
zh: 没有通行证

# passParseError
source: Error parsing pass
es: Error al analizar el pase
fr: Erreur lors de l'analyse du pass
zh: 解析通行证时出错

source: Settings
es: Ajustes
fr: Paramètres
zh: 设置

source: Theme
es: Tema
fr: Thème
zh: 主题

# themeColor
source: Design Color
es: Color del Tema
fr: Couleur du Thème
zh: 主题颜色

# themeColorDescription
source: Choose a color for the app design
es: Seleccione un color para el tema de la aplicación
fr: Sélectionnez une couleur pour le thème de l'application
zh: 为应用选择一个主题颜色

source: Theme Mode
es: Modo del Tema
fr: Mode du Thème
zh: 主题模式

# systemTheme
source: System
es: Sistema
fr: Système
zh: 系统

# lightTheme
source: Light
es: Claro
fr: Clair
zh: 浅色

# darkTheme
source: Dark
es: Oscuro
fr: Sombre
zh: 深色

source: Color Mode
es: Modo de Color
fr: Mode Couleur
zh: 颜色模式

# colorModeSystem
source: System Color
es: Color del Sistema
fr: Couleur du Système
zh: 系统颜色

# colorModeSystemDescription
source: Use the system's color
es: Usar el color del sistema
fr: Utiliser la couleur du système
zh: 使用系统颜色

# colorModeSeed
source: Seed Color
es: Color Semilla
fr: Couleur de Base
zh: 种子颜色

# colorModeIndividual
source: Individual Color
es: Color Individual
fr: Couleur Individuelle
zh: 自定义颜色

source: Individual Color Mode
es: Modo de Color Individual
fr: Mode Couleur Individuel
zh: 自定义颜色模式

# individualColorModeDescription
source: Select a custom color for each element in the app.
es: Seleccione un color personalizado para cada elemento en la aplicación.
fr: Sélectionnez une couleur personnalisée pour chaque élément de l'application.
zh: 为应用中的每个元素选择自定义颜色。

source: Primary Color
es: Color Primario
fr: Couleur Primaire
zh: 主色

source: On Primary Color
es: Sobre Color Primario
fr: Sur Couleur Primaire
zh: 主色上的颜色

source: Secondary Color
es: Color Secundario
fr: Couleur Secondaire
zh: 次要颜色

source: On Secondary Color
es: Sobre Color Secundario
fr: Sur Couleur Secondaire
zh: 次要颜色上的颜色

source: Surface Color
es: Color de Superficie
fr: Couleur de Surface
zh: 表面颜色

source: On Surface Color
es: Sobre Color de Superficie
fr: Sur Couleur de Surface
zh: 表面颜色上的颜色

source: Error Color
es: Color de Error
fr: Couleur d'Erreur
zh: 错误颜色

source: On Error Color
es: Sobre Color de Error
fr: Sur Couleur d'Erreur
zh: 错误颜色上的颜色

# passDoesNotSupportUpdates
source: This pass does not support updates.
es: Este pase no admite actualizaciones.
fr: Ce pass ne prend pas en charge les mises à jour.
zh: 此通行证不支持更新。

# passUpdateFailedOrNoUpdateAvailable
source: Failed to update pass or no update available.
es: La actualización del pase falló o no hay actualizaciones disponibles.
fr: La mise à jour du pass a échoué ou aucune mise à jour n'est disponible.
zh: 通行证更新失败或没有可用更新。

source: Delete Pass
es: Eliminar Pase
fr: Supprimer le Pass
zh: 删除通行证

# deletePassConfirmation
source: Are you sure you want to delete this pass? This action cannot be undone.
es: ¿Está seguro de que desea eliminar este pase? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer ce pass ? Cette action est irréversible.
zh: 您确定要删除此通行证吗？此操作无法撤销。

source: General
fr: Général
zh: 通用

# generalSettingsDesc
source: General Settings
es: Ajustes generales
fr: Paramètres généraux
zh: 通用设置

# themeSettingsDesc
source: Set the Theme and colors
es: Establecer tema y colores
fr: Définir le thème et les couleurs
zh: 设置主题和颜色

source: Dev
es: Desarrollo
fr: Développement
zh: 开发

# devSettingsDesc
source: Development Settings
es: Ajustes de desarrollo
fr: Paramètres de développement
zh: 开发设置

source: Settings Saved
es: Ajustes guardados
fr: Paramètres enregistrés
zh: 设置已保存

source: Pass Refresh
es: Actualizar Pase
fr: Actualiser le Pass
zh: 刷新通行证

source: Activate
es: Activar
fr: Activer
zh: 激活

# passRefreshHintText
source: Pass Refreshintervall (min)
es: Intervalo de actualización del pase (min)
fr: Intervalle de rafraîchissement du pass (min)
zh: 通行证刷新间隔（分钟）

# devLogs
source: Developer Logs
es: Registros de Desarrollador
fr: Logs de Développement
zh: 开发者日志

source: Clear Logs
es: Limpiar Registros
fr: Effacer les Logs
zh: 清除日志

source: Share Logs
es: Compartir Registros
fr: Partager les Logs
zh: 分享日志

source: App Logs
es: Registros de la Aplicación
fr: Logs de l'Application
zh: 应用日志

source: No logs to share
es: No hay registros para compartir
fr: Aucun log à partager
zh: 没有可分享的日志

source: No logs recorded yet
es: Aún no hay registros grabados
fr: Aucun log enregistré pour le moment
zh: 尚无日志记录
